In [1]:
import pandas as pd
l=["Name","surname","year","key"]
df1=pd.DataFrame(l)
df1

         0
0     Name
1  surname
2     year
3      key

In [2]:
dict={'Name':["Vaibhav","om","Rahul","Umesh"],
      'Age':[24,63,24,48],
      'Address':['pune',"mumbai","delhi","chennai"],
      "Education":["BSc","BE","MCom","BBA"]}
df2=pd.DataFrame(dict)
df2

      Name  Age  Address Education
0  Vaibhav   24     pune       BSc
1       om   63   mumbai        BE
2    Rahul   24    delhi      MCom
3    Umesh   48  chennai       BBA

In [8]:
print(df2[["Age",'Name']])

   Age     Name
0   24  Vaibhav
1   63       om
2   24    Rahul
3   48    Umesh

In [9]:
df2['marks']=[94,84,89,76]
df2

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
2    Rahul   24    delhi      MCom     89
3    Umesh   48  chennai       BBA     76

In [13]:
df2.drop(['Age'], axis = 1)

      Name  Address Education  marks
0  Vaibhav     pune       BSc     94
1       om   mumbai        BE     84
2    Rahul    delhi      MCom     89
3    Umesh  chennai       BBA     76

In [7]:
df2.drop(['Address'], axis = 1)

      Name  Age Education  marks
0  Vaibhav   24       BSc     94
1       om   63        BE     84
2    Rahul   24      MCom     89
3    Umesh   48       BBA     76

In [8]:
df2.drop(['Age'], axis = 1)

      Name  Address Education  marks
0  Vaibhav     pune       BSc     94
1       om   mumbai        BE     84
2    Rahul    delhi      MCom     89
3    Umesh  chennai       BBA     76

In [9]:
df2.drop('Age', axis = 1)

      Name  Address Education  marks
0  Vaibhav     pune       BSc     94
1       om   mumbai        BE     84
2    Rahul    delhi      MCom     89
3    Umesh  chennai       BBA     76

In [10]:
df2.drop(2,axis=0)

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
3    Umesh   48  chennai       BBA     76

In [11]:
print(df2)
print()
df2.drop(1,axis=0,inplace=True)
print(df2)

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
2    Rahul   24    delhi      MCom     89
3    Umesh   48  chennai       BBA     76

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
2    Rahul   24    delhi      MCom     89
3    Umesh   48  chennai       BBA     76

In [14]:
dict={'Name':["Vaibhav","om","Rahul","Umesh"],
      'Age':[24,63,24,48],
      'Address':['pune',"mumbai","delhi","chennai"],
      "Education":["BSc","BE","MCom","BBA"]}
df2=pd.DataFrame(dict)
df2

      Name  Age  Address Education
0  Vaibhav   24     pune       BSc
1       om   63   mumbai        BE
2    Rahul   24    delhi      MCom
3    Umesh   48  chennai       BBA

In [17]:
df2.loc[[0,2,3],["Name","Address"]]

      Name  Address
0  Vaibhav     pune
2    Rahul    delhi
3    Umesh  chennai

In [13]:
df2.columns

Index(['Name', 'Age', 'Address', 'Education'], dtype='object')

In [14]:
type(df2["Name"])

pandas.core.series.Series

In [18]:
import pandas as pd
df=pd.read_csv("Automobile_data.csv")
df

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
201,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
202,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
203,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.4,23.0,106,4800,26,27,22470
204,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [19]:
df.columns

Index(['symboling', 'normalized-losses', 'make', 'fuel-type', 'aspiration',
       'num-of-doors', 'body-style', 'drive-wheels', 'engine-location',
       'wheel-base', 'length', 'width', 'height', 'curb-weight', 'engine-type',
       'num-of-cylinders', 'engine-size', 'fuel-system', 'bore', 'stroke',
       'compression-ratio', 'horsepower', 'peak-rpm', 'city-mpg',
       'highway-mpg', 'price'],
      dtype='object')

In [16]:
dict={'Name':["Vaibhav","om","Rahul","Umesh"],
      'Age':[24,63,24,48],
      'Address':['pune',"mumbai","delhi","chennai"],
      "Education":["BSc","BE","MCom","BBA"]}
df2=pd.DataFrame(dict)
df2

      Name  Age  Address Education
0  Vaibhav   24     pune       BSc
1       om   63   mumbai        BE
2    Rahul   24    delhi      MCom
3    Umesh   48  chennai       BBA

In [17]:
df2["Age"].max()

63

In [18]:
df2['marks']=[94,84,89,76]

In [19]:
df2["marks"].max()

94

In [20]:
df2["marks"].min()

76

In [21]:
df['normalized-losses'].min()

NameError: name 'df' is not defined

In [ ]:
df['normalized-losses'].max()

In [ ]:
df2[df2.marks>80]

In [ ]:
df2[["Name","Address"]][df2.marks==df2["marks"].max()]

In [22]:
df.index

NameError: name 'df' is not defined

In [ ]:
df2.index

In [ ]:
df2

In [ ]:
df2[["Name","Address"]][df2.marks==df2["marks"].min()]

In [23]:
df2.describe()

             Age      marks
count   4.000000   4.000000
mean   39.750000  85.750000
std    19.189841   7.675719
min    24.000000  76.000000
25%    24.000000  82.000000
50%    36.000000  86.500000
75%    51.750000  90.250000
max    63.000000  94.000000

In [24]:
df2.drop(2,axis=0,inplace=True )

In [25]:
df2

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
3    Umesh   48  chennai       BBA     76

In [26]:
df2

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
3    Umesh   48  chennai       BBA     76

In [27]:
df2.index

Int64Index([0, 1, 3], dtype='int64')

In [28]:
df2.set_index("Name")

         Age  Address Education  marks
Name
Vaibhav   24     pune       BSc     94
om        63   mumbai        BE     84
Umesh     48  chennai       BBA     76

In [29]:
df2

      Name  Age  Address Education  marks
0  Vaibhav   24     pune       BSc     94
1       om   63   mumbai        BE     84
3    Umesh   48  chennai       BBA     76

In [30]:
df2.set_index("Name",inplace=True)

In [31]:
df2

         Age  Address Education  marks
Name
Vaibhav   24     pune       BSc     94
om        63   mumbai        BE     84
Umesh     48  chennai       BBA     76

In [32]:
df2.index

Index(['Vaibhav', 'om', 'Umesh'], dtype='object', name='Name')

In [45]:
df2.isnull()

    City  famous  price
0  False   False  False
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False
5  False   False  False
6  False   False  False
7  False   False  False

In [46]:
dict={'Name':["Vaibhav","om","Rahul","Umesh"],
      'Age':[24,63,24,48],
      'Address':['pune',"mumbai","delhi","chennai"],
      "Education":["BSc","BE","MCom","BBA"]}
df2=pd.DataFrame(dict)
df2

      Name  Age  Address Education
0  Vaibhav   24     pune       BSc
1       om   63   mumbai        BE
2    Rahul   24    delhi      MCom
3    Umesh   48  chennai       BBA

In [47]:
df2.notnull()

   Name   Age  Address  Education
0  True  True     True       True
1  True  True     True       True
2  True  True     True       True
3  True  True     True       True

In [48]:
df.describe()

NameError: name 'df' is not defined

In [49]:
import pandas as pd
import numpy as np
dict={
    "first":[12,13,np.nan,23],
    "second":[5,7,4,7],
    "third":[45,np.nan,57,np.nan]
}
df3=pd.DataFrame(dict)
df3

   first  second  third
0   12.0       5   45.0
1   13.0       7    NaN
2    NaN       4   57.0
3   23.0       7    NaN

In [50]:
df3.fillna(0)

   first  second  third
0   12.0       5   45.0
1   13.0       7    0.0
2    0.0       4   57.0
3   23.0       7    0.0

In [51]:
df3

   first  second  third
0   12.0       5   45.0
1   13.0       7    NaN
2    NaN       4   57.0
3   23.0       7    NaN

In [52]:
df.dropna()

NameError: name 'df' is not defined

In [53]:
df3.dropna()

   first  second  third
0   12.0       5   45.0

In [54]:
import pandas as pd
df=pd.read_csv(r"D:\Users\Admin\Desktop\data.csv")
df

FileNotFoundError: [Errno 2] No such file or directory: 'D:\\Users\\Admin\\Desktop\\data.csv'

In [55]:
df.dropna(inplace=True)

NameError: name 'df' is not defined

In [56]:
df

NameError: name 'df' is not defined

In [57]:
print(df)
print(df.dropna())

NameError: name 'df' is not defined

In [58]:
import numpy as np
label=["a","b","c"]
list=[3,5,25]
arr=np.array([35,46,24])
dict={'a':44,'b':46,'c':57}

In [59]:
pd.Series(data=list)

0     3
1     5
2    25
dtype: int64

In [60]:
pd.Series(data=list, index=label)

a     3
b     5
c    25
dtype: int64

In [61]:
pd.Series(arr,label)

a    35
b    46
c    24
dtype: int32

In [62]:
pd.Series(list,label)

a     3
b     5
c    25
dtype: int64

In [63]:
pd.Series(dict)

a    44
b    46
c    57
dtype: int64

In [ ]:
pd.Series(dict,label)

In [ ]:
pd.Series(dict,list)

In [ ]:
pd.Series(dict,list).dropna()

In [ ]:
pd.Series(dict,list).fillna(0)

In [ ]:
sport=pd.Series([25,3,65],index=["Cricket","Chess","TableTennis"])
print(sport)
print(sport["Chess"])

In [ ]:
df

In [34]:
dict={'City':["delhi","mumbai","pune","gurgav","mumbai","noida","gurgav","pune"],
      'famous':["sweet","vada","parathe","fruit","chair","pani","flowers","ball"],
      'price':[1000,465,441,100,200,600,500,40],
      }
df2=pd.DataFrame(dict)
df2

     City   famous  price
0   delhi    sweet   1000
1  mumbai     vada    465
2    pune  parathe    441
3  gurgav    fruit    100
4  mumbai    chair    200
5   noida     pani    600
6  gurgav  flowers    500
7    pune     ball     40

In [35]:
ndf=df2.groupby("City")
ndf

In [36]:
for city,data in ndf:
    print(city,data)

delhi     City famous  price
0  delhi  sweet   1000
gurgav      City   famous  price
3  gurgav    fruit    100
6  gurgav  flowers    500
mumbai      City famous  price
1  mumbai   vada    465
4  mumbai  chair    200
noida     City famous  price
5  noida   pani    600
pune    City   famous  price
2  pune  parathe    441
7  pune     ball     40

In [37]:
for city,data in ndf:
    print(city)

delhi
gurgav
mumbai
noida
pune

In [38]:
for city,data in ndf:
    print(city)
    print("\n",data,"\n")

delhi

     City famous  price
0  delhi  sweet   1000

gurgav

      City   famous  price
3  gurgav    fruit    100
6  gurgav  flowers    500

mumbai

      City famous  price
1  mumbai   vada    465
4  mumbai  chair    200

noida

     City famous  price
5  noida   pani    600

pune

    City   famous  price
2  pune  parathe    441
7  pune     ball     40

In [39]:
ndf.get_group("pune")

   City   famous  price
2  pune  parathe    441
7  pune     ball     40

In [40]:
ndf.max()

         famous  price
City
delhi     sweet   1000
gurgav    fruit    500
mumbai     vada    465
noida      pani    600
pune    parathe    441

In [41]:
ndf.min()

         famous  price
City
delhi     sweet   1000
gurgav  flowers    100
mumbai    chair    200
noida      pani    600
pune       ball     40

In [42]:
ndf.mean()

         price
City
delhi   1000.0
gurgav   300.0
mumbai   332.5
noida    600.0
pune     240.5

In [43]:
ndf.describe()

       price
       count    mean         std     min      25%     50%      75%     max
City
delhi    1.0  1000.0         NaN  1000.0  1000.00  1000.0  1000.00  1000.0
gurgav   2.0   300.0  282.842712   100.0   200.00   300.0   400.00   500.0
mumbai   2.0   332.5  187.383297   200.0   266.25   332.5   398.75   465.0
noida    1.0   600.0         NaN   600.0   600.00   600.0   600.00   600.0
pune     2.0   240.5  283.549819    40.0   140.25   240.5   340.75   441.0

In [44]:
ndf.size()

City
delhi     1
gurgav    2
mumbai    2
noida     1
pune      2
dtype: int64